Repository: Me4eHoseC/SpiderBLU
Catalog: lib/l10n/*.arb
Languages: ru

# settingsPage
source: Settings
ru: Настройки

# mapPage
source: Map
ru: Карта

# devicesTablePage
source: Devices Table
ru: Список Устройств

# deviceParametersPage
source: Device Parameters
ru: Параметры Устройств

# imagePage
source: Photo
ru: Фото

# seismicPage
source: Seismic
ru: Сейсмика

# scannerPage
source: Scanner
ru: Сканер

# protocolPage
source: Protocol
ru: Протокол

source: Dark Mode
ru: Тёмная тема

source: Language
ru: Язык

source: Remote BT devices:
ru: Обнаруженные BT устройства:

source: Select device
ru: Выберете устройство

# checkCOMSTD
source: COM STD
ru: COM СППУ

source: Available COM devices:
ru: Обнаруженные COM устройства:

# checkTCPSTD
source: TCP STD
ru: TCP СППУ

# enterIpv4
source: Enter IPv4 address and port:
ru: Введите IPv4 адрес и порт:

source: Port
ru: Порт

# ipv4AddressCanT
source: IPv4 address can't be empty
ru: IPv4 адрес не может быть пустым

# ipv4EnterCorrect
source: Enter correct IPv4 address
ru: Введите корректный IPv4 адрес

# portCanT
source: IP port can't be empty
ru: IP порт не может быть пустым

# portEnterCorrect
source: Enter correct IP port
ru: Введите корректный IP порт

# deviceOffline
source: Device #{oldId} offline
ru: Устройство #{oldId} выключено

# markerName
source: Marker
ru: Маркер

# airsName
source: A-IRS
ru: А-ИКД

# cpdName
source: CPD
ru: КФУ

# csdName
source: CSD
ru: КСД

# mcdName
source: MCD
ru: МУК

# rtName
source: RT
ru: РТ

# stdName
source: STD
ru: СППУ

source: ID
ru: ИД:

source: Type:
ru: Тип:

source: Date/time:
ru: Дата/Время:

source: Firmware version:
ru: Версия прошивки:

source: Main
ru: Основные

source: Coordinates
ru: Координаты

source: Connected devices
ru: Подключенные устройства

source: External power
ru: Внешнее питание

source: Radio
ru: Радиосеть

source: Save/Reset settings
ru: Сохранение/Сброс настроек

source: Seismic
ru: Сейсмика

source: Camera
ru: Камера

source: Power supply
ru: Источник питания

source: Latitude:
ru: Широта:

source: Longitude:
ru: Долгота:

source: Signal strength:
ru: Мощность сигнала:

source: Allowed hops
ru: Разрешенные хопы:

source: Unallowed hops
ru: Запрещенные хопы:

# rebroadcastToEveryone
source: Retransmit to all:
ru: Ретранслировать всем:

# resetRetransmission
source: Reset retransmissions
ru: Сброс ретрансляций

# saveAlertDialog
source: Do you really want to save all settings on selected device?
ru: Сохранить все настройки на выбранном устройстве?

# buttonAccept
source: Accept
ru: Принять

# buttonCancel
source: Cancel
ru: Отмена

# rebootDeviceDialog
source: Do you really want to reboot selected device?
ru: Перезапустить выбранное устройство?

# factoryResetDialog
source: Do you really want to reset selected device to factory settings?
ru: Вернуть заводские настройки на выбранном устройстве?

# rebootDeviceButton
source: Reboot device
ru: Перезапуск устройства

# saveSettingsButton
source: Save settings
ru: Сохранить настройки

# factoryResetButton
source: Factory reset
ru: Возврат к заводским

source: On/Off in. dev.:
ru: Вкл/выкл внеш. устр.:

source: In. dev. 1:
ru: Внеш. устр. 1:

source: In. dev. 2:
ru: Внеш. устр. 2:

source: Device status:
ru: Статус устройства:

source: Geophone:
ru: Геофон:

source: Camera trap:
ru: Фотоловушка:

source: Safety catch:
ru: Предохранитель:

source: Activation delay:
ru: Задержка активации:

# activationDelaySec
source: {value} sec.
ru: {value} сек.

source: Pulse duration:
ru: Длительность импульса:

# turnOnDueBreakline
source: Turn on due to breakline:
ru: Включение по обрывной:

source: Power:
ru: Питание:

# voltage
source: Voltage, V:
ru: Напряжение, V:

# temperature
source: Temperature, °С:
ru: Температура, °С:

source: Human:
ru: Человек:

source: Transport:
ru: Транспорт:

source: Signal swing:
ru: Размах сигнала:

# humanSens
source: Human sensitivity:(25-255)
ru: Чувствительность по человеку:(25-255)

# errorSens
source: Sensitivity from 0 to 255
ru: Чувствительность от 0 до 255

# transportSens
source: Transport sensitivity:(25-255)
ru: Чувствительность по транспорту:(25-255)

source: Criterion filter:
ru: Критерийный фильтр:

# ratioSignal
source: Transport signal to noise ratio:(5-40)
ru: Отношение сигнал транспорта/шум:(5-40)

# errorRatio
source: Ratio from 5 to 40
ru: Соотношение от 5 до 40

# recognitionParam
source: Recognition parameters:
ru: Параметры распознавания:

# interHum
source: Interference/Person
ru: Помеха/Человек

# humTrans
source: Human/Transport
ru: Человек/Транспорт

# errorParam
source: Parameters from 0 to 255
ru: Значение параметров от 0 до 255

# alarmFiltr
source: Alarm filtering:
ru: Фильтры тревог:

# singleHum
source: Single(human):
ru: Одиночные (человек):

# serialHum
source: Series(human):
ru: Серийные (человек):

# singleTrans
source: Single(transport):
ru: Одиночные (транспорт):

# serialTrans
source: Series(transport):
ru: Серийные (транспорт):

# requestError
source: Request data first
ru: Сначала запросите данные

# serialDrop
source: {value} in {value}0 sec.
ru: {value} в {value}0 сек.

# oneOfThree
source: 1 of 3
ru: 1 за 3

# twoOfThree
source: 2 of 3
ru: 2 за 3

# threeOfThree
source: 3 of 3
ru: 3 за 3

# twoOfFour
source: 2 of 4
ru: 2 за 4

# threeOfFour
source: 3 of 4
ru: 3 за 4

# fourOfFour
source: 4 of 4
ru: 4 за 4

# idExist
source: This ID already exists
ru: Устройство с этим ИД уже нанесено

# invalidId
source: Invalid ID ID can be from 1 to 255
ru: Неверный ИД ИД может быть от 1 до 255

# stdOnMap
source: STD is already on the map
ru: СППУ уже нанесен

# alarmFromDevice
source: Alarm from device #{value}
ru: Тревога с устр. #{value}:

# reasonUnknown
source: UNKNOWN
ru: НЕИЗВЕСТНО

# reasonHuman
source: HUMAN
ru: ЧЕЛОВЕК

# reasonAuto
source: AUTO
ru: ТРАНСПОРТ

# reasonBat
source: BATTERY
ru: БАТАРЕЯ

# typeLine1
source: LINE_1
ru: ОБРЫВНАЯ_1

# typeLine2
source: LINE_2
ru: ОБРЫВНАЯ_2

# typeSeismic
source: SEISMIC
ru: СЕЙСМИКА

# typeTrap
source: TRAP
ru: ФОТОЛОВУШКА

# typeRadiation
source: RADIATION
ru: РАДИАЦИЯ

# typeCatchOFF
source: EXT_POWER_SAFETY_CATCH_OFF
ru: ПРЕДОХРАНИТЕЛЬ_СНЯТ

# typePowerTriggered
source: AUTO_EXT_POWER_TRIGGERED
ru: АВТОВЗВЕДЕНИЕ_ВКЛЮЧЕНО

# typeNo
source: NO
ru: НЕТ

source: Sensitivity:
ru: Чувствительность:

# photoComp
source: Photo compression:
ru: Сжатие фото:

source: Priority:
ru: Приоритет:

source: Treshold IRS:
ru: Порог ИКД:

source: Apply
ru: Принять

source: Select All
ru: Выбрать все

source: Unselect All
ru: Снять выбор

source: Clear
ru: Очистить

# scanButton
source: Scan
ru: Скан.

source: Mapped
ru: На Карте

# alarmsFilterSystemEvent
source: Alarms filter: H{value1}, T{value2}
ru: Фильтр тревог: Ч{value1}, Т{value2}

source: Application launched
ru: Приложение запущено

source: Application closed
ru: Приложение закрыто

source: Admin mode
ru: Режим администратора

source: User mode
ru: Режим пользователя

source: NetTree building
ru: Построение сетевого дерева

source: NetTree destroying
ru: Разрушение сетевого дерева

source: NetTree changed
ru: Изменение сетевого дерева

source: HTTP on
ru: HTTP вкл

source: HTTP off
ru: HTTP выкл

source: HTTP error
ru: HTTP ошибка

source: Poll started
ru: Опрос начат

source: Poll finished
ru: Опрос закончен

# variosEventsOperatorNameNotEmpty
source: from {value}
ru: от {value}

# variosEventsReport
source: Report{value1}{value2}
ru: Отчёт{value1}{value2}

# statusOnline
source: Online
ru: Онлайн

# statusOffline
source: Offline
ru: Оффлайн

# statusSTDConnected
source: STD connected
ru: СППУ подключено

# statusSTDDisconnected
source: STD disconnected
ru: СППУ отключено

source: Weak battery
ru: Низкий заряд

source: Safety catch off
ru: Предохранитель снят

source: Auto ext. power
ru: Авто. внеш. питание

# checkResult
source: Check result: {value}
ru: Проверка результата: {value}

# actionsTaken
source: Actions taken: {value}
ru: Принятые меры: {value}

# operatorName
source: Operator name: {value}
ru: Имя оператора: {value}

# alarmEventTypeHuman
source: Human {value}
ru: Человек {value}

# alarmEventTypeTransport
source: Transport {value}
ru: Транспорт {value}

# alarmEventBreakline
source: Breakline #{value1} {value2} ({value3})
ru: Обрывная #{value1} {value2} ({value3})

# alarmEventTypeBreakline
source: Breakline
ru: Обрывная

# alarmEventSeriesHuman
source: Human
ru: Человек

# alarmEventSeriesTransport
source: Transport
ru: Транспорт

# alarmEventTypeSeries
source: {value1} series {value2} (total: {value})
ru: {value1} серия {value2} (всего: {value})

# alarmEventTypeLfo
source: LFO (Devices: {value})
ru: НЛЦ (Устройства: {value})

source: Phototrap
ru: Фотоловушка

# alarmEventTypePhototrap
source: Phototrap (from #{value})
ru: Фотоловушка (с #{value})

# alarmEventTypeRadiationLess
source: less x1.5
ru: меньше x1.5

# alarmEventTypeRadiationMore
source: more x255
ru: больше x255

# alarmEventTypeRadiation
source: Radiation #{value1} ({value2})
ru: Радиация #{value1} ({value2})

# commandEventTypeTimeSynchronised
source: Time synchronize
ru: Синхр. время

# commandEventTypeBatteryChanged
source: Battery change
ru: Замена батареи

# commandEventTypeExternalPowerOn
source: Ext. power on
ru: Внеш. пит. вкл

# commandEventTypeExternalPowerOff
source: Ext. power off
ru: Внеш. пит. выкл

# commandEventTypeDeviceRebooted
source: Reboot
ru: Перезапуск

# commandEventTypeSettingsStored
source: Settings stored
ru: Настройки сохранены

# commandEventTypeSettingsReset
source: Settings reset
ru: Настройки сброшены

# commandEventTypeExtPowerSafetyCatchOn
source: Safety catch on
ru: Предохранитель вкл

# commandEventTypeExtPowerSafetyCatchOff
source: Safety catch off
ru: Предохранитель выкл

# commandEventOperatorTypeLocalOperatorSent
source: Executed by local operator #{value}.
ru: Выполнено локальным оператором #{value}.

# commandEventOperatorTypeRemoteOperatorSent
source: Executed by remote operator #{value}.
ru: Выполнено удаленным оператором #{value}.

# commandEventOperatorTypeAutomaticsSent
source: Executed by script.
ru: Выполнено скриптом.

source: Failed to send command.
ru: Провалена попытка отправки команды.

# commandEventOperatorTypeLocalOperatorFailed
source: Attempted by local operator #{value}.
ru: Попытка локального оператора #{value}.

# commandEventOperatorTypeRemoteOperatorFailed
source: Attempted by remote operator #{value}.
ru: Попытка скрипта.

# coordinatesEvents
source: Coordinates: {value1}, {value2}
ru: Координаты: {value1}, {value2}

# internalDevicesCommandEventStateBreakline1
source: Breakline 1
ru: Обрывная 1

# internalDevicesCommandEventStateBreakline2
source: Breakline 2
ru: Обрывная 2

# internalDevicesCommandEventStatePhototrapBreakline
source: Phototrap breakline
ru: Фотоловушка

# internalDevicesCommandEventStateGeophone
source: Geophone
ru: Геофон

# internalDevices
source: Internal devices: {value}
ru: Внешние устройства: {value}

# chanelNumber
source: Channel #{value}
ru: Канал #{value}

source: Min
ru: Мин

source: Low
ru: Низ

source: Med
ru: Ср

source: High
ru: Выс

source: Max
ru: Макс

# cameraLightTresholdAndCompression
source: Camera: {value1}, {value2}
ru: Камера: {value1}, {value2}

# phototrapTriggerID
source: Phototrap trigger: #{value}
ru: Триггер фотоловушки: #{value}

# recognitionClasses
source: Recognition classes: {value}
ru: Классы распознования: {value}

source: Undefined
ru: Неопределено

# thresholdNameAndValue
source: {value1} threshold: {value2}
ru: {value1} порог: {value2}

# stepThreshold
source: Step threshold: {value} Hz
ru: Порог шага: {value} Hz

# recognCrit
source: Recogn. crit.: {value}
ru: Распозн. крит.: {value}

# onePerTen
source: 1 per 10
ru: 1 за 10

# twoPerTwenty
source: 2 per 20
ru: 2 за 20

# threePerThirty
source: 3 per 30
ru: 3 за 30

# filter
source: Filter: H{value1} - {value2}, T{value3} - {value4}
ru: Фильтр: Ч{value1} - {value2}, Т{value3} - {value4}

source: on
ru: вкл

source: off
ru: выкл

# extPower
source: var ext. power {value}
ru: Внеш. пит. {value}

source: All
ru: Всё

# radTreshold
source: Rad. threshold. {value1}: {value2}
ru: Порог рад. {value1}: {value2}

source: Device
ru: Устройство

source: Alarm poll
ru: Опрос тревог

source: Save poll
ru: Опрос сохраненных

source: Regular poll
ru: Регулярный опрос

source: Init poll
ru: Стартовый опрос

source: STD poll
ru: Опрос СППУ

source: Offline poll
ru: Опрос оффлайн устройств
